# ConcreteCompression Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..ConcreteCompression Property
StructuralAsset Class See Also
---
The compression strength of concrete-based assets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ConcreteCompression { get; set; }
```

Visual Basic
---
```text
Public Property ConcreteCompression As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ConcreteCompression {
	double get ();
	void set (double value);
}
```

# Remarks
Applies to concrete-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be concrete to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace